femat7/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet       { $:calculated.alphat; }
    outlet      { $:calculated.alphat; }
    movingWalls { $:wall.alphat; }
    staticWalls { $movingWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
